{
  "sections": [
    {
      "id": "intro",
      "title": "مقدمة وتنبيه هام",
      "content": "<p>المستند ده <strong>للمعلومات فقط</strong>. بيوضح طريقتي في الشغل، إيه اللي هعمله، وإيه اللي العميل ميتوقعوش مني. <strong>ده مش عقد قانوني</strong>، و<strong>غير ملزم قانونياً</strong>، و<strong>مش مُمضي</strong>، و<strong>مفيش أي حاجة هنا غرضها إنها تُستخدم في المحاكم أو أي إجراءات قانونية</strong>.</p><p>بمجرد قرارك بالعمل معايا، ده معناه إنك موافق إن المستند ده مجرد دليل استرشادي للتعامل مش اتفاقية قانونية.</p><p><strong>مين أنا:</strong> مهدي ياسر — مطور ومؤسس فيتروم. بصمم وببني مواقع وتطبيقات ومنتجات رقمية لعملاء من كل حتة في العالم.</p><p><strong>النطاق:</strong> القواعد دي بتنطبق على كل مشروع بسلمه، إلا لو اتفقنا بوضوح على قواعد تانية قبل ما أبدأ.</p>"
    },
    {
      "id": "ownership",
      "title": "1. ملكية الشغل وحقوق الاستخدام",
      "content": "<p>بقدم خيارات مرنة للملكية على حسب اتفاقنا وقت تحديد نطاق المشروع. وهوضح دايماً أي خيار اللي هيتطبق قبل ما نبدأ.</p><h3>الخيار (أ) — ملكية كاملة ليا (الوضع الافتراضي)</h3><ul><li>بحتفظ بملكية كل الأكواد، أطر العمل (Frameworks)، والأنظمة اللي بستخدمها أو ببنيها بشكل دائم.</li><li>دفع تكلفة المشروع <strong>مش</strong> معناه نقل ملكية السيستم أو الهياكل البرمجية القابلة لإعادة الاستخدام.</li><li>بتاخد ترخيص (License) لاستخدام الموقع/التطبيق للغرض اللي اتعمل علشانه.</li><li>ممنوع إعادة بيع الشغل أو توزيعه أو الادعاء بملكية الأنظمة الداخلية للمشروع.</li></ul><h3>الخيار (ب) — ملكية مشتركة / محدودة</h3><ul><li>ممكن تاخد حقوق لاستخدام وتعديل المشروع لاحتياجاتك الخاصة.</li><li>بحتفظ بحقي في إعادة استخدام أو تعديل أو بيع الأكواد والمكونات اللي بنيتها لمشروعك. لكن العميل مينفعش يبيع المنتج بالكامل.</li></ul><h3>الخيار (ج) — ملكية كاملة لفترة انطلاق (Head-start)</h3><ul><li>بتاخد <strong>حقوق الملكية الكاملة</strong> للمخرجات المتفق عليها <strong>طول فترة الـ head-start</strong>.</li><li><strong>الفترة دي بتبدأ فوراً</strong> من وقت التسليم.</li><li>خلال الفترة دي، <strong>مش هعيد استخدام أو بيع أو تكرار نفس الشغل</strong> (أو شغل مشابه بشكل كبير) لأي حد تاني.</li><li>الغرض من الفترة دي هو \"الحصرية\": إنك تكون <strong>الوحيد</strong> اللي بيستخدم الحل ده خلال المدة المتفق عليها.</li><li>بعد ما الفترة دي تخلص، الملكية وحقوق إعادة الاستخدام بترجع للي اتفقنا عليه (مثلاً: إني أعيد استخدام الأفكار العامة أو المكونات غير الحصرية).</li><li>مدة ونطاق فترة الـ head-start لازم نتفق عليهم بوضوح قبل البداية.</li></ul><h3>الخيار (د) — اتفاق خاص</h3><ul><li>أي تفاصيل تانية للملكية مش متغطية فوق، هتتحدد في اتفاقية المشروع اللي بنكتبها ونوقعها قبل الشغل.</li></ul><blockquote>هوضح دايماً ونأكد سوا على الخيار اللي هنمشي بيه. لو محتاج نقل كامل وحصري لكل الحقوق، عرفني قبل ما نبدأ عشان أحسب تكلفتها وأصيغها صح.</blockquote>"
    },
    {
      "id": "backend",
      "title": "2. النظام والبرمجيات (السيستم بالكامل)",
      "content": "<ul><li>\"النظام والبرمجة الخلفية\" معناها <strong>كل حاجة بتخلي المنتج يشتغل</strong> ورا الكواليس.</li><li>ده بيشمل: المنطق البرمجي، هيكل الكود، الـ APIs، قواعد البيانات، لوحات التحكم (CMS)، الأتمتة، والربط بين الأنظمة.</li><li><strong>سيرفرات الاستضافة مش ملكي.</strong> السيرفرات ملك لشركة الاستضافة اللي العميل بيختارها. أنا ماليش سلطة على البنية التحتية للاستضافة إلا لو قولنا غير كده.</li><li>بحتفظ بكل الحقوق في السيستم اللي بصممه، إلا لو اتفقنا صراحةً على حاجة تانية.</li><li>بتاخد الحقوق اللي تخليك تستخدم وتدير منتجك، بس مش حق بيعه أو توزيع الكود الخاص بالسيستم.</li><li>أي نقل للملكية أو الحصرية في البرمجة الخلفية لازم نتفق عليه قبل البداية وده ممكن يغير في السعر.</li></ul>"
    },
    {
      "id": "design",
      "title": "3. إعادة استخدام التصميم والأسلوب",
      "content": "<ul><li>ممكن أعيد استخدام أنماط التصميم أو المكونات اللي عملتها لك في مشاريع تانية. التشابه البصري في العناصر العامة مش معناه إن مشروعك اتقلد؛ ده طبيعي جداً في عالم التصميم.</li><li>لو اتفقنا إن في أصول (Assets) أو ستايل معين حصري لمشروعك، ده هيتكتب في اتفاقية المشروع.</li></ul>"
    },
    {
      "id": "support",
      "title": "4. دعم ما بعد التسليم (تصليح الأخطاء والتعديلات)",
      "content": "<p>بقدم فترة دعم بعد التسليم. مدتها بتتحدد في الاتفاقية، بس العادي بتاعي هو <strong>21 يوم</strong> من بعد التسليم.</p><p><strong>خلال فترة الدعم (الـ 21 يوم الافتراضية):</strong></p><ul><li>هصلح أي أخطاء برمجة (Bugs) أنا اللي تسببت فيها، وهعمل التعديلات البسيطة اللي كانت في نطاق الاتفاق.</li><li>أي مميزات كبيرة جديدة أو تغيير في نطاق المشروع هيعتبر مشروع جديد بـ تكلفة منفصلة.</li></ul><p><strong>بعد انتهاء فترة الدعم:</strong></p><ul><li>أي شغل زيادة أو تصليح أخطاء مش هيكون مشمول تلقائياً وهيحتاج اتفاق جديد.</li><li>أنا مش ملزم أقبل شغل إضافي بعد الفترة دي، بس ممكن أقدم خيارات مدفوعة لو طلبت.</li></ul>"
    },
    {
      "id": "payment",
      "title": "5. الدفع والتسعير",
      "content": "<ul><li>لو الخدمة معروضة بسعر معين على صفحة خدمات فيتروم، يبقى ده السعر اللي هتدفعه إلا لو اتفقنا كتابةً على غير كده.</li><li>العربون الثابت هو <strong>50%</strong> قبل ما أبدأ في المشاريع اللي سعرها محدد؛ النسبة دي أنا بس اللي أقدر أغيرها وهتتذكر في الاتفاقية.</li><li>المشاريع الخاصة (Custom) اللي مش موجودة في صفحة الخدمات، سعرها وجدول دفعها بيكون بالاتفاق وممكن يتغير لو نطاق الشغل اتغير.</li><li>لو اتفقنا على سعر ثابت كتابةً، هلتزم بيه ومش هغيره طالما الشغل هو هو اللي اتفقنا عليه.</li><li>طريقة الدفع ومواعيدها هتتحدد في الاتفاقية ولازم العميل يلتزم بيها.</li></ul><p><strong>الفترات التجريبية (لو متاحة):</strong></p><ul><li>غرضها توضيح الفكرة أو التأكد إن المنتج شغال كويس، مش فترة تقييم مفتوحة.</li><li>مش هتزيد عن <strong>21 يوم</strong> إلا لو وافقت بوضوح.</li><li>ممكن أنهي الفترة التجريبية بدري لو المنتج أثبت نجاحه وأطلب الدفع وقتها.</li></ul>"
    },
    {
      "id": "revisions",
      "title": "6. المراجعات وطلبات التعديل",
      "content": "<ul><li>بحدد عدد مرات مراجعة في نطاق المشروع. أي مراجعات زيادة أو تغيير في النطاق ممكن يزود التكلفة.</li><li>التعديلات الجوهرية اللي بتغير فكرة المشروع الأساسية هتتحسب كشغل إضافي.</li></ul>"
    },
    {
      "id": "responsibilities",
      "title": "7. مسؤوليات العميل",
      "content": "<ul><li>توفير محتوى دقيق، وصلاحيات الوصول، وأي داتا أطلبها في وقتها.</li><li>التأكد إن المحتوى اللي بتبعته (صور، نصوص، لوجو..) مش بينتهك حقوق حد تاني أو قوانين النشر.</li></ul><p><strong>وقت الرد على البيانات المطلوبة:</strong></p><ul><li>لما أطلب داتا للمشروع (صور، منيو، أسعار، بيانات دخول)، العميل لازم يبعتها <strong>في أسرع وقت ممكن (ASAP)</strong>.</li><li>إلا لو اتفقنا على غير كده، <strong>أسرع وقت ده معناه خلال 24 ساعة</strong> من الطلب.</li><li>لو العميل اتأخر عن الوقت ده، ممكن تطبق <strong>غرامة تأخير</strong> بتتحسب بالساعة.</li><li>الغرامة الافتراضية هي <strong>250 جنيه مصري لكل ساعة</strong> تأخير.</li></ul><p><strong>استثناءات منطقية:</strong></p><ul><li>في حاجات بتاخد وقت طبيعي (زي تجميع صور أكل لمطعم أو داتا كبيرة). في الحالة دي بنتفق على ميعاد منطقي يناسب الظروف، والميعاد ده هو اللي بيمشي بدل قاعدة الـ 24 ساعة.</li></ul>"
    },
    {
      "id": "prohibited",
      "title": "8. الاستخدامات الممنوعة",
      "content": "<ul><li>مش هبني أو أدعم أي حاجة غير قانونية أو غير أخلاقية أو بتخالف شروط المنصات (زي الـ Spam، البرامج الضارة، أو النصب).</li><li>لو العميل استخدم الشغل في حاجة سببت مشاكل قانونية، أنا ماليش أي علاقة بالنتائج دي.</li></ul>"
    },
    {
      "id": "liability",
      "title": "9. المسؤولية والضمان",
      "content": "<ul><li>هسلم شغل جودته مطابقة للي اتفقنا عليه.</li><li>أنا مش مسؤول عن أي خسائر غير مباشرة أو ضياع أرباح ناتج عن استخدام المنتج.</li><li>أي ضمانات خاصة بالأداء أو الأمان لازم تتكتب في الاتفاقية، وإلا مفيش ضمانات ضمنية.</li></ul>"
    },
    {
      "id": "termination",
      "title": "10. الإلغاء والإنهاء",
      "content": "<ul><li>أي طرف يقدر يلغي المشروع. الشغل اللي خلص لازم يدفع تمنه.</li><li>المبالغ اللي اتدفعت مش بتترد إلا لو اتفقنا على غير كده.</li></ul>"
    },
    {
      "id": "portfolio",
      "title": "11. معرض الأعمال والدعاية",
      "content": "<ul><li>من حقي أقول إني اشتغلت معاك وأحط المشروع في معرض أعمالي أو التسويق لنفسي.</li><li>ممكن أستخدم لقطات شاشة أو أجزاء من الكود إلا لو اتفقنا كتابةً على السرية التامة.</li><li>ممكن أنشر رأيك (Testimonial) في الشغل بعد موافقتك. وبنتظر من العميل إنه يسيب رأيه لما نخلص المشروع.</li></ul>"
    },
    {
      "id": "final-notes",
      "title": "12. ملاحظات أخيرة",
      "content": "<ul><li>المستند ده مش عقد قانوني ولا يترتب عليه التزامات قضائية.</li><li>ميقدرش أي حد يستخدم الكلام ده كدليل في المحكمة.</li><li>النسخة اللي بنشوفها وقت بداية المشروع هي اللي بتحدد شكل التعامل بينا بشكل ودي.</li><li>لو حصل خلاف، المستند ده مجرد مرجع لأسلوب الشغل مش إثبات قانوني.</li></ul>"
    },
    {
      "id": "privacy",
      "title": "سياسة الخصوصية — بياناتك في أمان",
      "content": "<p><strong>بجمع إيه؟</strong> بيانات الاتصال (اسم، إيميل، تليفون) وأي ملفات بتبعتها للمشروع.</p><p><strong>ليه بجمعها؟</strong> عشان نتواصل، نخلص الشغل، ونطلع الفواتير.</p><p><strong>بستخدمها إزاي؟</strong> في التواصل بخصوص المشروع والدعم الفني.</p><p><strong>مشاركة البيانات:</strong> أنا شغال لوحدي ومش ببيع بياناتك لحد. ممكن أشارك تفاصيل بسيطة مع شركاء لو المشروع محتاج ده وبعد موافقتك.</p><p><strong>الأمان:</strong> باخد كل الاحتياطات عشان أحمي بياناتك، وبحتفظ بيها بس طول ما إحنا محتاجينها للمشروع.</p><p><strong>حقوقك:</strong> تقدر في أي وقت تسألني عن بياناتك اللي عندي أو تطلب أمسح البيانات الشخصية غير الضرورية.</p>"
    },
    {
      "id": "contact",
      "title": "تواصل معايا",
      "content": "<p>مهدي ياسر — فيتروم</p><p>الإيميل: <a href=\"mailto:mahdi@mahdiyasser.site\">mahdi@mahdiyasser.site</a></p><p>صفحة التواصل: <a href=\"https://mahdiyasser.site/contact\" target=\"_blank\">https://mahdiyasser.site/contact</a></p><p>الموقع الشخصي: <a href=\"https://mahdiyasser.site\" target=\"_blank\">https://mahdiyasser.site</a></p>"
    }
  ]
}
